esp8266/Arduino/boards.txt
##############################################################
oak.name=Digistump Oak
oak.build.board=ESP8266_OAK
oak.build.variant=oak
oak.upload.maximum_size=1040368
oak.upload.tool=esptool
oak.upload.maximum_data_size=81920
oak.upload.wait_for_upload_port=true
oak.upload.erase_cmd=
oak.serial.disableDTR=true
oak.serial.disableRTS=true
oak.build.mcu=esp8266
oak.build.core=esp8266
oak.build.spiffs_pagesize=256
oak.build.debug_optim=
oak.build.debug_port=
oak.build.debug_level=
oak.menu.xtal.80=80 MHz
oak.menu.xtal.80.build.f_cpu=80000000L
oak.menu.xtal.160=160 MHz
oak.menu.xtal.160.build.f_cpu=160000000L
oak.menu.vt.flash=Flash
oak.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
oak.menu.vt.heap=Heap
oak.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
oak.menu.vt.iram=IRAM
oak.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
oak.menu.exception.disabled=Disabled (new aborts on oom)
oak.menu.exception.disabled.build.exception_flags=-fno-exceptions
oak.menu.exception.disabled.build.stdcpp_lib=-lstdc++
oak.menu.exception.enabled=Enabled
oak.menu.exception.enabled.build.exception_flags=-fexceptions
oak.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
oak.menu.stacksmash.disabled=Disabled
oak.menu.stacksmash.disabled.build.stacksmash_flags=
oak.menu.stacksmash.enabled=Enabled
oak.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
oak.menu.ssl.all=All SSL ciphers (most compatible)
oak.menu.ssl.all.build.sslflags=
oak.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
oak.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
oak.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
oak.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
oak.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
oak.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
oak.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
oak.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
oak.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
oak.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
oak.menu.mmu.ext128k=128K Heap External 23LC1024
oak.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
oak.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
oak.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
oak.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
oak.menu.non32xfer.fast.build.non32xferflags=
oak.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
oak.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
oak.upload.resetmethod=--before no_reset --after soft_reset
oak.build.flash_mode=dio
oak.build.flash_flags=-DFLASHMODE_DIO
oak.build.flash_freq=40
oak.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
oak.menu.eesz.4M2M.build.flash_size=4M
oak.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
oak.menu.eesz.4M2M.build.spiffs_pagesize=256
oak.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
oak.menu.eesz.4M2M.build.spiffs_start=0x200000
oak.menu.eesz.4M2M.build.spiffs_end=0x3FA000
oak.menu.eesz.4M2M.build.spiffs_blocksize=8192
oak.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
oak.menu.eesz.4M3M.build.flash_size=4M
oak.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
oak.menu.eesz.4M3M.build.spiffs_pagesize=256
oak.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
oak.menu.eesz.4M3M.build.spiffs_start=0x100000
oak.menu.eesz.4M3M.build.spiffs_end=0x3FA000
oak.menu.eesz.4M3M.build.spiffs_blocksize=8192
oak.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
oak.menu.eesz.4M1M.build.flash_size=4M
oak.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
oak.menu.eesz.4M1M.build.spiffs_pagesize=256
oak.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
oak.menu.eesz.4M1M.build.spiffs_start=0x300000
oak.menu.eesz.4M1M.build.spiffs_end=0x3FA000
oak.menu.eesz.4M1M.build.spiffs_blocksize=8192
oak.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
oak.menu.eesz.4M.build.flash_size=4M
oak.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
oak.menu.eesz.4M.build.spiffs_pagesize=256
oak.menu.eesz.4M.build.rfcal_addr=0x3FC000
oak.menu.ip.lm2f=v2 Lower Memory
oak.menu.ip.lm2f.build.lwip_include=lwip2/include
oak.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
oak.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
oak.menu.ip.hb2f=v2 Higher Bandwidth
oak.menu.ip.hb2f.build.lwip_include=lwip2/include
oak.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
oak.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
oak.menu.ip.lm2n=v2 Lower Memory (no features)
oak.menu.ip.lm2n.build.lwip_include=lwip2/include
oak.menu.ip.lm2n.build.lwip_lib=-llwip2-536
oak.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
oak.menu.ip.hb2n=v2 Higher Bandwidth (no features)
oak.menu.ip.hb2n.build.lwip_include=lwip2/include
oak.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
oak.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
oak.menu.ip.lm6f=v2 IPv6 Lower Memory
oak.menu.ip.lm6f.build.lwip_include=lwip2/include
oak.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
oak.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
oak.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
oak.menu.ip.hb6f.build.lwip_include=lwip2/include
oak.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
oak.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
oak.menu.dbg.Disabled=Disabled
oak.menu.dbg.Disabled.build.debug_port=
oak.menu.dbg.Serial=Serial
oak.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
oak.menu.dbg.Serial1=Serial1
oak.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
oak.menu.lvl.None____=None
oak.menu.lvl.None____.build.debug_level=
oak.menu.optim.Smallest=None
oak.menu.optim.Smallest.build.debug_optim=-Os
oak.menu.optim.Lite=Lite
oak.menu.optim.Lite.build.debug_optim=-Os -fno-optimize-sibling-calls
oak.menu.optim.Full=Optimum
oak.menu.optim.Full.build.debug_optim=-Og
oak.menu.lvl.SSL=SSL
oak.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
oak.menu.lvl.TLS_MEM=TLS_MEM
oak.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
oak.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
oak.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.HTTP_SERVER=HTTP_SERVER
oak.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
oak.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
oak.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
oak.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
oak.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
oak.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.CORE=CORE
oak.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
oak.menu.lvl.WIFI=WIFI
oak.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
oak.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
oak.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
oak.menu.lvl.UPDATER=UPDATER
oak.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
oak.menu.lvl.OTA=OTA
oak.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
oak.menu.lvl.OOM=OOM
oak.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
oak.menu.lvl.MDNS=MDNS
oak.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
oak.menu.lvl.HWDT=HWDT
oak.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
oak.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
oak.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
oak.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
oak.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
oak.menu.wipe.none=Only Sketch
oak.menu.wipe.none.upload.erase_cmd=
oak.menu.wipe.sdk=Sketch + WiFi Settings
oak.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
oak.menu.wipe.all=All Flash Contents
oak.menu.wipe.all.upload.erase_cmd=erase_flash
oak.menu.baud.921600=921600
oak.menu.baud.921600.upload.speed=921600
oak.menu.baud.57600=57600
oak.menu.baud.57600.upload.speed=57600
oak.menu.baud.115200=115200
oak.menu.baud.115200.upload.speed=115200
oak.menu.baud.230400.linux=230400
oak.menu.baud.230400.macosx=230400
oak.menu.baud.230400.upload.speed=230400
oak.menu.baud.256000.windows=256000
oak.menu.baud.256000.upload.speed=256000
oak.menu.baud.460800.linux=460800
oak.menu.baud.460800.macosx=460800
oak.menu.baud.460800.upload.speed=460800
oak.menu.baud.512000.windows=512000
oak.menu.baud.512000.upload.speed=512000
oak.menu.baud.3000000=3000000
oak.menu.baud.3000000.upload.speed=3000000
oak.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
oak.menu.eesz.autoflash.build.flash_size=16M
oak.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
oak.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
oak.menu.eesz.autoflash.upload.maximum_size=1044464
oak.menu.iramfloat.no=Not allowed in ISR (more IRAM)
oak.menu.iramfloat.no.build.iramfloat=-DFP_IN_IROM
oak.menu.iramfloat.yes=Allowed in ISR (less IRAM)
oak.menu.iramfloat.yes.build.iramfloat=-DFP_IN_IRAM

