esp8266/Arduino/boards.txt
##############################################################
espectro.name=ESPectro Core
espectro.build.board=ESP8266_ESPECTRO_CORE
espectro.build.variant=espectro
espectro.upload.tool=esptool
espectro.upload.maximum_data_size=81920
espectro.upload.wait_for_upload_port=true
espectro.upload.erase_cmd=
espectro.serial.disableDTR=true
espectro.serial.disableRTS=true
espectro.build.mcu=esp8266
espectro.build.core=esp8266
espectro.build.spiffs_pagesize=256
espectro.build.debug_optim=
espectro.build.debug_port=
espectro.build.debug_level=
espectro.menu.xtal.80=80 MHz
espectro.menu.xtal.80.build.f_cpu=80000000L
espectro.menu.xtal.160=160 MHz
espectro.menu.xtal.160.build.f_cpu=160000000L
espectro.menu.vt.flash=Flash
espectro.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espectro.menu.vt.heap=Heap
espectro.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espectro.menu.vt.iram=IRAM
espectro.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espectro.menu.exception.disabled=Disabled (new aborts on oom)
espectro.menu.exception.disabled.build.exception_flags=-fno-exceptions
espectro.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espectro.menu.exception.enabled=Enabled
espectro.menu.exception.enabled.build.exception_flags=-fexceptions
espectro.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espectro.menu.stacksmash.disabled=Disabled
espectro.menu.stacksmash.disabled.build.stacksmash_flags=
espectro.menu.stacksmash.enabled=Enabled
espectro.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
espectro.menu.ssl.all=All SSL ciphers (most compatible)
espectro.menu.ssl.all.build.sslflags=
espectro.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espectro.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espectro.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
espectro.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espectro.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
espectro.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
espectro.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
espectro.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
espectro.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
espectro.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
espectro.menu.mmu.ext128k=128K Heap External 23LC1024
espectro.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espectro.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
espectro.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espectro.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
espectro.menu.non32xfer.fast.build.non32xferflags=
espectro.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
espectro.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
espectro.upload.resetmethod=--before default_reset --after hard_reset
espectro.build.flash_mode=dio
espectro.build.flash_flags=-DFLASHMODE_DIO
espectro.build.flash_freq=40
espectro.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espectro.menu.eesz.4M2M.build.flash_size=4M
espectro.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espectro.menu.eesz.4M2M.build.spiffs_pagesize=256
espectro.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espectro.menu.eesz.4M2M.build.spiffs_start=0x200000
espectro.menu.eesz.4M2M.build.spiffs_end=0x3FA000
espectro.menu.eesz.4M2M.build.spiffs_blocksize=8192
espectro.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espectro.menu.eesz.4M3M.build.flash_size=4M
espectro.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espectro.menu.eesz.4M3M.build.spiffs_pagesize=256
espectro.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espectro.menu.eesz.4M3M.build.spiffs_start=0x100000
espectro.menu.eesz.4M3M.build.spiffs_end=0x3FA000
espectro.menu.eesz.4M3M.build.spiffs_blocksize=8192
espectro.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espectro.menu.eesz.4M1M.build.flash_size=4M
espectro.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espectro.menu.eesz.4M1M.build.spiffs_pagesize=256
espectro.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espectro.menu.eesz.4M1M.build.spiffs_start=0x300000
espectro.menu.eesz.4M1M.build.spiffs_end=0x3FA000
espectro.menu.eesz.4M1M.build.spiffs_blocksize=8192
espectro.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espectro.menu.eesz.4M.build.flash_size=4M
espectro.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espectro.menu.eesz.4M.build.spiffs_pagesize=256
espectro.menu.eesz.4M.build.rfcal_addr=0x3FC000
espectro.menu.ip.lm2f=v2 Lower Memory
espectro.menu.ip.lm2f.build.lwip_include=lwip2/include
espectro.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espectro.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espectro.menu.ip.hb2f=v2 Higher Bandwidth
espectro.menu.ip.hb2f.build.lwip_include=lwip2/include
espectro.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espectro.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espectro.menu.ip.lm2n=v2 Lower Memory (no features)
espectro.menu.ip.lm2n.build.lwip_include=lwip2/include
espectro.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espectro.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espectro.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espectro.menu.ip.hb2n.build.lwip_include=lwip2/include
espectro.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espectro.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espectro.menu.ip.lm6f=v2 IPv6 Lower Memory
espectro.menu.ip.lm6f.build.lwip_include=lwip2/include
espectro.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espectro.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espectro.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espectro.menu.ip.hb6f.build.lwip_include=lwip2/include
espectro.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espectro.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espectro.menu.dbg.Disabled=Disabled
espectro.menu.dbg.Disabled.build.debug_port=
espectro.menu.dbg.Serial=Serial
espectro.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espectro.menu.dbg.Serial1=Serial1
espectro.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espectro.menu.lvl.None____=None
espectro.menu.lvl.None____.build.debug_level=
espectro.menu.optim.Smallest=None
espectro.menu.optim.Smallest.build.debug_optim=-Os
espectro.menu.optim.Lite=Lite
espectro.menu.optim.Lite.build.debug_optim=-Os -fno-optimize-sibling-calls
espectro.menu.optim.Full=Optimum
espectro.menu.optim.Full.build.debug_optim=-Og
espectro.menu.lvl.SSL=SSL
espectro.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espectro.menu.lvl.TLS_MEM=TLS_MEM
espectro.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espectro.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espectro.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espectro.menu.lvl.HTTP_SERVER=HTTP_SERVER
espectro.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espectro.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espectro.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espectro.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espectro.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espectro.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espectro.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espectro.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espectro.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espectro.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espectro.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espectro.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espectro.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espectro.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espectro.menu.lvl.CORE=CORE
espectro.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espectro.menu.lvl.WIFI=WIFI
espectro.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espectro.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espectro.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espectro.menu.lvl.UPDATER=UPDATER
espectro.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espectro.menu.lvl.OTA=OTA
espectro.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espectro.menu.lvl.OOM=OOM
espectro.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espectro.menu.lvl.MDNS=MDNS
espectro.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
espectro.menu.lvl.HWDT=HWDT
espectro.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
espectro.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
espectro.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
espectro.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espectro.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espectro.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espectro.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espectro.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espectro.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espectro.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espectro.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espectro.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espectro.menu.wipe.none=Only Sketch
espectro.menu.wipe.none.upload.erase_cmd=
espectro.menu.wipe.sdk=Sketch + WiFi Settings
espectro.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espectro.menu.wipe.all=All Flash Contents
espectro.menu.wipe.all.upload.erase_cmd=erase_flash
espectro.menu.baud.115200=115200
espectro.menu.baud.115200.upload.speed=115200
espectro.menu.baud.57600=57600
espectro.menu.baud.57600.upload.speed=57600
espectro.menu.baud.230400.linux=230400
espectro.menu.baud.230400.macosx=230400
espectro.menu.baud.230400.upload.speed=230400
espectro.menu.baud.256000.windows=256000
espectro.menu.baud.256000.upload.speed=256000
espectro.menu.baud.460800.linux=460800
espectro.menu.baud.460800.macosx=460800
espectro.menu.baud.460800.upload.speed=460800
espectro.menu.baud.512000.windows=512000
espectro.menu.baud.512000.upload.speed=512000
espectro.menu.baud.921600=921600
espectro.menu.baud.921600.upload.speed=921600
espectro.menu.baud.3000000=3000000
espectro.menu.baud.3000000.upload.speed=3000000
espectro.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
espectro.menu.eesz.autoflash.build.flash_size=16M
espectro.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
espectro.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
espectro.menu.eesz.autoflash.upload.maximum_size=1044464
espectro.menu.iramfloat.no=Not allowed in ISR (more IRAM)
espectro.menu.iramfloat.no.build.iramfloat=-DFP_IN_IROM
espectro.menu.iramfloat.yes=Allowed in ISR (less IRAM)
espectro.menu.iramfloat.yes.build.iramfloat=-DFP_IN_IRAM

