esp8266/Arduino/boards.txt
##############################################################
agruminolemon.name=Lifely Agrumino Lemon v4
agruminolemon.build.board=ESP8266_AGRUMINO_LEMON_V4
agruminolemon.build.variant=agruminolemonv4
agruminolemon.upload.tool=esptool
agruminolemon.upload.maximum_data_size=81920
agruminolemon.upload.wait_for_upload_port=true
agruminolemon.upload.erase_cmd=
agruminolemon.serial.disableDTR=true
agruminolemon.serial.disableRTS=true
agruminolemon.build.mcu=esp8266
agruminolemon.build.core=esp8266
agruminolemon.build.spiffs_pagesize=256
agruminolemon.build.debug_optim=
agruminolemon.build.debug_port=
agruminolemon.build.debug_level=
agruminolemon.menu.xtal.80=80 MHz
agruminolemon.menu.xtal.80.build.f_cpu=80000000L
agruminolemon.menu.xtal.160=160 MHz
agruminolemon.menu.xtal.160.build.f_cpu=160000000L
agruminolemon.menu.vt.flash=Flash
agruminolemon.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
agruminolemon.menu.vt.heap=Heap
agruminolemon.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
agruminolemon.menu.vt.iram=IRAM
agruminolemon.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
agruminolemon.menu.exception.disabled=Disabled (new aborts on oom)
agruminolemon.menu.exception.disabled.build.exception_flags=-fno-exceptions
agruminolemon.menu.exception.disabled.build.stdcpp_lib=-lstdc++
agruminolemon.menu.exception.enabled=Enabled
agruminolemon.menu.exception.enabled.build.exception_flags=-fexceptions
agruminolemon.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
agruminolemon.menu.stacksmash.disabled=Disabled
agruminolemon.menu.stacksmash.disabled.build.stacksmash_flags=
agruminolemon.menu.stacksmash.enabled=Enabled
agruminolemon.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
agruminolemon.menu.ssl.all=All SSL ciphers (most compatible)
agruminolemon.menu.ssl.all.build.sslflags=
agruminolemon.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
agruminolemon.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
agruminolemon.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
agruminolemon.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
agruminolemon.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
agruminolemon.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
agruminolemon.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
agruminolemon.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
agruminolemon.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
agruminolemon.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
agruminolemon.menu.mmu.ext128k=128K Heap External 23LC1024
agruminolemon.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
agruminolemon.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
agruminolemon.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
agruminolemon.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
agruminolemon.menu.non32xfer.fast.build.non32xferflags=
agruminolemon.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
agruminolemon.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
agruminolemon.upload.resetmethod=--before default_reset --after hard_reset
agruminolemon.build.flash_mode=dio
agruminolemon.build.flash_flags=-DFLASHMODE_DIO
agruminolemon.build.flash_freq=40
agruminolemon.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
agruminolemon.menu.eesz.2M64.build.flash_size=2M
agruminolemon.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
agruminolemon.menu.eesz.2M64.build.spiffs_pagesize=256
agruminolemon.menu.eesz.2M64.build.rfcal_addr=0x1FC000
agruminolemon.menu.eesz.2M64.build.spiffs_start=0x1F0000
agruminolemon.menu.eesz.2M64.build.spiffs_end=0x1FB000
agruminolemon.menu.eesz.2M64.build.spiffs_blocksize=4096
agruminolemon.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
agruminolemon.menu.eesz.2M128.build.flash_size=2M
agruminolemon.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
agruminolemon.menu.eesz.2M128.build.spiffs_pagesize=256
agruminolemon.menu.eesz.2M128.build.rfcal_addr=0x1FC000
agruminolemon.menu.eesz.2M128.build.spiffs_start=0x1E0000
agruminolemon.menu.eesz.2M128.build.spiffs_end=0x1FB000
agruminolemon.menu.eesz.2M128.build.spiffs_blocksize=4096
agruminolemon.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
agruminolemon.menu.eesz.2M256.build.flash_size=2M
agruminolemon.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
agruminolemon.menu.eesz.2M256.build.spiffs_pagesize=256
agruminolemon.menu.eesz.2M256.build.rfcal_addr=0x1FC000
agruminolemon.menu.eesz.2M256.build.spiffs_start=0x1C0000
agruminolemon.menu.eesz.2M256.build.spiffs_end=0x1FB000
agruminolemon.menu.eesz.2M256.build.spiffs_blocksize=4096
agruminolemon.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
agruminolemon.menu.eesz.2M512.build.flash_size=2M
agruminolemon.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
agruminolemon.menu.eesz.2M512.build.spiffs_pagesize=256
agruminolemon.menu.eesz.2M512.build.rfcal_addr=0x1FC000
agruminolemon.menu.eesz.2M512.build.spiffs_start=0x180000
agruminolemon.menu.eesz.2M512.build.spiffs_end=0x1FA000
agruminolemon.menu.eesz.2M512.build.spiffs_blocksize=8192
agruminolemon.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
agruminolemon.menu.eesz.2M1M.build.flash_size=2M
agruminolemon.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
agruminolemon.menu.eesz.2M1M.build.spiffs_pagesize=256
agruminolemon.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
agruminolemon.menu.eesz.2M1M.build.spiffs_start=0x100000
agruminolemon.menu.eesz.2M1M.build.spiffs_end=0x1FA000
agruminolemon.menu.eesz.2M1M.build.spiffs_blocksize=8192
agruminolemon.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
agruminolemon.menu.eesz.2M.build.flash_size=2M
agruminolemon.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
agruminolemon.menu.eesz.2M.build.spiffs_pagesize=256
agruminolemon.menu.eesz.2M.build.rfcal_addr=0x1FC000
agruminolemon.menu.ip.lm2f=v2 Lower Memory
agruminolemon.menu.ip.lm2f.build.lwip_include=lwip2/include
agruminolemon.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
agruminolemon.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
agruminolemon.menu.ip.hb2f=v2 Higher Bandwidth
agruminolemon.menu.ip.hb2f.build.lwip_include=lwip2/include
agruminolemon.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
agruminolemon.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
agruminolemon.menu.ip.lm2n=v2 Lower Memory (no features)
agruminolemon.menu.ip.lm2n.build.lwip_include=lwip2/include
agruminolemon.menu.ip.lm2n.build.lwip_lib=-llwip2-536
agruminolemon.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
agruminolemon.menu.ip.hb2n=v2 Higher Bandwidth (no features)
agruminolemon.menu.ip.hb2n.build.lwip_include=lwip2/include
agruminolemon.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
agruminolemon.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
agruminolemon.menu.ip.lm6f=v2 IPv6 Lower Memory
agruminolemon.menu.ip.lm6f.build.lwip_include=lwip2/include
agruminolemon.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
agruminolemon.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
agruminolemon.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
agruminolemon.menu.ip.hb6f.build.lwip_include=lwip2/include
agruminolemon.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
agruminolemon.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
agruminolemon.menu.dbg.Disabled=Disabled
agruminolemon.menu.dbg.Disabled.build.debug_port=
agruminolemon.menu.dbg.Serial=Serial
agruminolemon.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
agruminolemon.menu.dbg.Serial1=Serial1
agruminolemon.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
agruminolemon.menu.lvl.None____=None
agruminolemon.menu.lvl.None____.build.debug_level=
agruminolemon.menu.optim.Smallest=None
agruminolemon.menu.optim.Smallest.build.debug_optim=-Os
agruminolemon.menu.optim.Lite=Lite
agruminolemon.menu.optim.Lite.build.debug_optim=-Os -fno-optimize-sibling-calls
agruminolemon.menu.optim.Full=Optimum
agruminolemon.menu.optim.Full.build.debug_optim=-Og
agruminolemon.menu.lvl.SSL=SSL
agruminolemon.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
agruminolemon.menu.lvl.TLS_MEM=TLS_MEM
agruminolemon.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
agruminolemon.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
agruminolemon.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
agruminolemon.menu.lvl.HTTP_SERVER=HTTP_SERVER
agruminolemon.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
agruminolemon.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
agruminolemon.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
agruminolemon.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
agruminolemon.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
agruminolemon.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
agruminolemon.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
agruminolemon.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
agruminolemon.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
agruminolemon.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
agruminolemon.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
agruminolemon.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agruminolemon.menu.lvl.CORE=CORE
agruminolemon.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
agruminolemon.menu.lvl.WIFI=WIFI
agruminolemon.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
agruminolemon.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
agruminolemon.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
agruminolemon.menu.lvl.UPDATER=UPDATER
agruminolemon.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
agruminolemon.menu.lvl.OTA=OTA
agruminolemon.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
agruminolemon.menu.lvl.OOM=OOM
agruminolemon.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
agruminolemon.menu.lvl.MDNS=MDNS
agruminolemon.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
agruminolemon.menu.lvl.HWDT=HWDT
agruminolemon.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
agruminolemon.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
agruminolemon.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
agruminolemon.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
agruminolemon.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
agruminolemon.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
agruminolemon.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
agruminolemon.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
agruminolemon.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
agruminolemon.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
agruminolemon.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
agruminolemon.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
agruminolemon.menu.wipe.none=Only Sketch
agruminolemon.menu.wipe.none.upload.erase_cmd=
agruminolemon.menu.wipe.sdk=Sketch + WiFi Settings
agruminolemon.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
agruminolemon.menu.wipe.all=All Flash Contents
agruminolemon.menu.wipe.all.upload.erase_cmd=erase_flash
agruminolemon.menu.baud.115200=115200
agruminolemon.menu.baud.115200.upload.speed=115200
agruminolemon.menu.baud.57600=57600
agruminolemon.menu.baud.57600.upload.speed=57600
agruminolemon.menu.baud.230400.linux=230400
agruminolemon.menu.baud.230400.macosx=230400
agruminolemon.menu.baud.230400.upload.speed=230400
agruminolemon.menu.baud.256000.windows=256000
agruminolemon.menu.baud.256000.upload.speed=256000
agruminolemon.menu.baud.460800.linux=460800
agruminolemon.menu.baud.460800.macosx=460800
agruminolemon.menu.baud.460800.upload.speed=460800
agruminolemon.menu.baud.512000.windows=512000
agruminolemon.menu.baud.512000.upload.speed=512000
agruminolemon.menu.baud.921600=921600
agruminolemon.menu.baud.921600.upload.speed=921600
agruminolemon.menu.baud.3000000=3000000
agruminolemon.menu.baud.3000000.upload.speed=3000000
agruminolemon.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
agruminolemon.menu.eesz.autoflash.build.flash_size=16M
agruminolemon.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
agruminolemon.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
agruminolemon.menu.eesz.autoflash.upload.maximum_size=1044464
agruminolemon.menu.iramfloat.no=Not allowed in ISR (more IRAM)
agruminolemon.menu.iramfloat.no.build.iramfloat=-DFP_IN_IROM
agruminolemon.menu.iramfloat.yes=Allowed in ISR (less IRAM)
agruminolemon.menu.iramfloat.yes.build.iramfloat=-DFP_IN_IRAM

