esp8266/Arduino/boards.txt
##############################################################
wiolink.name=Seeed Wio Link
wiolink.build.board=ESP8266_WIO_LINK
wiolink.build.variant=wiolink
wiolink.upload.tool=esptool
wiolink.upload.maximum_data_size=81920
wiolink.upload.wait_for_upload_port=true
wiolink.upload.erase_cmd=
wiolink.serial.disableDTR=true
wiolink.serial.disableRTS=true
wiolink.build.mcu=esp8266
wiolink.build.core=esp8266
wiolink.build.spiffs_pagesize=256
wiolink.build.debug_optim=
wiolink.build.debug_port=
wiolink.build.debug_level=
wiolink.menu.xtal.80=80 MHz
wiolink.menu.xtal.80.build.f_cpu=80000000L
wiolink.menu.xtal.160=160 MHz
wiolink.menu.xtal.160.build.f_cpu=160000000L
wiolink.menu.vt.flash=Flash
wiolink.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
wiolink.menu.vt.heap=Heap
wiolink.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
wiolink.menu.vt.iram=IRAM
wiolink.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
wiolink.menu.exception.disabled=Disabled (new aborts on oom)
wiolink.menu.exception.disabled.build.exception_flags=-fno-exceptions
wiolink.menu.exception.disabled.build.stdcpp_lib=-lstdc++
wiolink.menu.exception.enabled=Enabled
wiolink.menu.exception.enabled.build.exception_flags=-fexceptions
wiolink.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
wiolink.menu.stacksmash.disabled=Disabled
wiolink.menu.stacksmash.disabled.build.stacksmash_flags=
wiolink.menu.stacksmash.enabled=Enabled
wiolink.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
wiolink.menu.ssl.all=All SSL ciphers (most compatible)
wiolink.menu.ssl.all.build.sslflags=
wiolink.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
wiolink.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
wiolink.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
wiolink.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
wiolink.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
wiolink.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
wiolink.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
wiolink.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
wiolink.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
wiolink.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
wiolink.menu.mmu.ext128k=128K Heap External 23LC1024
wiolink.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
wiolink.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
wiolink.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
wiolink.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
wiolink.menu.non32xfer.fast.build.non32xferflags=
wiolink.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
wiolink.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
wiolink.upload.resetmethod=--before default_reset --after hard_reset
wiolink.build.flash_mode=qio
wiolink.build.flash_flags=-DFLASHMODE_QIO
wiolink.build.flash_freq=40
wiolink.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
wiolink.menu.eesz.4M2M.build.flash_size=4M
wiolink.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
wiolink.menu.eesz.4M2M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
wiolink.menu.eesz.4M2M.build.spiffs_start=0x200000
wiolink.menu.eesz.4M2M.build.spiffs_end=0x3FA000
wiolink.menu.eesz.4M2M.build.spiffs_blocksize=8192
wiolink.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
wiolink.menu.eesz.4M3M.build.flash_size=4M
wiolink.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
wiolink.menu.eesz.4M3M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
wiolink.menu.eesz.4M3M.build.spiffs_start=0x100000
wiolink.menu.eesz.4M3M.build.spiffs_end=0x3FA000
wiolink.menu.eesz.4M3M.build.spiffs_blocksize=8192
wiolink.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
wiolink.menu.eesz.4M1M.build.flash_size=4M
wiolink.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
wiolink.menu.eesz.4M1M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
wiolink.menu.eesz.4M1M.build.spiffs_start=0x300000
wiolink.menu.eesz.4M1M.build.spiffs_end=0x3FA000
wiolink.menu.eesz.4M1M.build.spiffs_blocksize=8192
wiolink.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
wiolink.menu.eesz.4M.build.flash_size=4M
wiolink.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
wiolink.menu.eesz.4M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M.build.rfcal_addr=0x3FC000
wiolink.menu.ip.lm2f=v2 Lower Memory
wiolink.menu.ip.lm2f.build.lwip_include=lwip2/include
wiolink.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
wiolink.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wiolink.menu.ip.hb2f=v2 Higher Bandwidth
wiolink.menu.ip.hb2f.build.lwip_include=lwip2/include
wiolink.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
wiolink.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wiolink.menu.ip.lm2n=v2 Lower Memory (no features)
wiolink.menu.ip.lm2n.build.lwip_include=lwip2/include
wiolink.menu.ip.lm2n.build.lwip_lib=-llwip2-536
wiolink.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wiolink.menu.ip.hb2n=v2 Higher Bandwidth (no features)
wiolink.menu.ip.hb2n.build.lwip_include=lwip2/include
wiolink.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
wiolink.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wiolink.menu.ip.lm6f=v2 IPv6 Lower Memory
wiolink.menu.ip.lm6f.build.lwip_include=lwip2/include
wiolink.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
wiolink.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wiolink.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
wiolink.menu.ip.hb6f.build.lwip_include=lwip2/include
wiolink.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
wiolink.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wiolink.menu.dbg.Disabled=Disabled
wiolink.menu.dbg.Disabled.build.debug_port=
wiolink.menu.dbg.Serial=Serial
wiolink.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wiolink.menu.dbg.Serial1=Serial1
wiolink.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
wiolink.menu.lvl.None____=None
wiolink.menu.lvl.None____.build.debug_level=
wiolink.menu.optim.Smallest=None
wiolink.menu.optim.Smallest.build.debug_optim=-Os
wiolink.menu.optim.Lite=Lite
wiolink.menu.optim.Lite.build.debug_optim=-Os -fno-optimize-sibling-calls
wiolink.menu.optim.Full=Optimum
wiolink.menu.optim.Full.build.debug_optim=-Og
wiolink.menu.lvl.SSL=SSL
wiolink.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
wiolink.menu.lvl.TLS_MEM=TLS_MEM
wiolink.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
wiolink.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
wiolink.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.HTTP_SERVER=HTTP_SERVER
wiolink.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
wiolink.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
wiolink.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
wiolink.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
wiolink.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
wiolink.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.CORE=CORE
wiolink.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
wiolink.menu.lvl.WIFI=WIFI
wiolink.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
wiolink.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
wiolink.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
wiolink.menu.lvl.UPDATER=UPDATER
wiolink.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
wiolink.menu.lvl.OTA=OTA
wiolink.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
wiolink.menu.lvl.OOM=OOM
wiolink.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
wiolink.menu.lvl.MDNS=MDNS
wiolink.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
wiolink.menu.lvl.HWDT=HWDT
wiolink.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
wiolink.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
wiolink.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
wiolink.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
wiolink.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
wiolink.menu.wipe.none=Only Sketch
wiolink.menu.wipe.none.upload.erase_cmd=
wiolink.menu.wipe.sdk=Sketch + WiFi Settings
wiolink.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
wiolink.menu.wipe.all=All Flash Contents
wiolink.menu.wipe.all.upload.erase_cmd=erase_flash
wiolink.menu.baud.115200=115200
wiolink.menu.baud.115200.upload.speed=115200
wiolink.menu.baud.57600=57600
wiolink.menu.baud.57600.upload.speed=57600
wiolink.menu.baud.230400.linux=230400
wiolink.menu.baud.230400.macosx=230400
wiolink.menu.baud.230400.upload.speed=230400
wiolink.menu.baud.256000.windows=256000
wiolink.menu.baud.256000.upload.speed=256000
wiolink.menu.baud.460800.linux=460800
wiolink.menu.baud.460800.macosx=460800
wiolink.menu.baud.460800.upload.speed=460800
wiolink.menu.baud.512000.windows=512000
wiolink.menu.baud.512000.upload.speed=512000
wiolink.menu.baud.921600=921600
wiolink.menu.baud.921600.upload.speed=921600
wiolink.menu.baud.3000000=3000000
wiolink.menu.baud.3000000.upload.speed=3000000
wiolink.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
wiolink.menu.eesz.autoflash.build.flash_size=16M
wiolink.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
wiolink.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
wiolink.menu.eesz.autoflash.upload.maximum_size=1044464
wiolink.menu.iramfloat.no=Not allowed in ISR (more IRAM)
wiolink.menu.iramfloat.no.build.iramfloat=-DFP_IN_IROM
wiolink.menu.iramfloat.yes=Allowed in ISR (less IRAM)
wiolink.menu.iramfloat.yes.build.iramfloat=-DFP_IN_IRAM

