esp8266/Arduino/boards.txt
##############################################################
thingdev.name=SparkFun ESP8266 Thing Dev
thingdev.build.board=ESP8266_THING_DEV
thingdev.build.variant=thing
thingdev.upload.tool=esptool
thingdev.upload.maximum_data_size=81920
thingdev.upload.wait_for_upload_port=true
thingdev.upload.erase_cmd=
thingdev.serial.disableDTR=true
thingdev.serial.disableRTS=true
thingdev.build.mcu=esp8266
thingdev.build.core=esp8266
thingdev.build.spiffs_pagesize=256
thingdev.build.debug_optim=
thingdev.build.debug_port=
thingdev.build.debug_level=
thingdev.menu.xtal.80=80 MHz
thingdev.menu.xtal.80.build.f_cpu=80000000L
thingdev.menu.xtal.160=160 MHz
thingdev.menu.xtal.160.build.f_cpu=160000000L
thingdev.menu.vt.flash=Flash
thingdev.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
thingdev.menu.vt.heap=Heap
thingdev.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
thingdev.menu.vt.iram=IRAM
thingdev.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
thingdev.menu.exception.disabled=Disabled (new aborts on oom)
thingdev.menu.exception.disabled.build.exception_flags=-fno-exceptions
thingdev.menu.exception.disabled.build.stdcpp_lib=-lstdc++
thingdev.menu.exception.enabled=Enabled
thingdev.menu.exception.enabled.build.exception_flags=-fexceptions
thingdev.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
thingdev.menu.stacksmash.disabled=Disabled
thingdev.menu.stacksmash.disabled.build.stacksmash_flags=
thingdev.menu.stacksmash.enabled=Enabled
thingdev.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
thingdev.menu.ssl.all=All SSL ciphers (most compatible)
thingdev.menu.ssl.all.build.sslflags=
thingdev.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
thingdev.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
thingdev.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
thingdev.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
thingdev.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
thingdev.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
thingdev.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
thingdev.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
thingdev.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
thingdev.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
thingdev.menu.mmu.ext128k=128K Heap External 23LC1024
thingdev.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
thingdev.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
thingdev.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
thingdev.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
thingdev.menu.non32xfer.fast.build.non32xferflags=
thingdev.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
thingdev.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
thingdev.upload.resetmethod=--before default_reset --after hard_reset
thingdev.build.flash_mode=dio
thingdev.build.flash_flags=-DFLASHMODE_DIO
thingdev.build.flash_freq=40
thingdev.menu.eesz.512K32=512KB (FS:32KB OTA:~230KB)
thingdev.menu.eesz.512K32.build.flash_size=512K
thingdev.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
thingdev.menu.eesz.512K32.build.spiffs_pagesize=256
thingdev.menu.eesz.512K32.build.rfcal_addr=0x7C000
thingdev.menu.eesz.512K32.build.spiffs_start=0x73000
thingdev.menu.eesz.512K32.build.spiffs_end=0x7B000
thingdev.menu.eesz.512K32.build.spiffs_blocksize=4096
thingdev.menu.eesz.512K64=512KB (FS:64KB OTA:~214KB)
thingdev.menu.eesz.512K64.build.flash_size=512K
thingdev.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
thingdev.menu.eesz.512K64.build.spiffs_pagesize=256
thingdev.menu.eesz.512K64.build.rfcal_addr=0x7C000
thingdev.menu.eesz.512K64.build.spiffs_start=0x6B000
thingdev.menu.eesz.512K64.build.spiffs_end=0x7B000
thingdev.menu.eesz.512K64.build.spiffs_blocksize=4096
thingdev.menu.eesz.512K128=512KB (FS:128KB OTA:~182KB)
thingdev.menu.eesz.512K128.build.flash_size=512K
thingdev.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
thingdev.menu.eesz.512K128.build.spiffs_pagesize=256
thingdev.menu.eesz.512K128.build.rfcal_addr=0x7C000
thingdev.menu.eesz.512K128.build.spiffs_start=0x5B000
thingdev.menu.eesz.512K128.build.spiffs_end=0x7B000
thingdev.menu.eesz.512K128.build.spiffs_blocksize=4096
thingdev.menu.eesz.512K=512KB (FS:none OTA:~246KB)
thingdev.menu.eesz.512K.build.flash_size=512K
thingdev.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
thingdev.menu.eesz.512K.build.spiffs_pagesize=256
thingdev.menu.eesz.512K.build.rfcal_addr=0x7C000
thingdev.menu.ip.lm2f=v2 Lower Memory
thingdev.menu.ip.lm2f.build.lwip_include=lwip2/include
thingdev.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
thingdev.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
thingdev.menu.ip.hb2f=v2 Higher Bandwidth
thingdev.menu.ip.hb2f.build.lwip_include=lwip2/include
thingdev.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
thingdev.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
thingdev.menu.ip.lm2n=v2 Lower Memory (no features)
thingdev.menu.ip.lm2n.build.lwip_include=lwip2/include
thingdev.menu.ip.lm2n.build.lwip_lib=-llwip2-536
thingdev.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
thingdev.menu.ip.hb2n=v2 Higher Bandwidth (no features)
thingdev.menu.ip.hb2n.build.lwip_include=lwip2/include
thingdev.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
thingdev.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
thingdev.menu.ip.lm6f=v2 IPv6 Lower Memory
thingdev.menu.ip.lm6f.build.lwip_include=lwip2/include
thingdev.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
thingdev.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
thingdev.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
thingdev.menu.ip.hb6f.build.lwip_include=lwip2/include
thingdev.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
thingdev.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
thingdev.menu.dbg.Disabled=Disabled
thingdev.menu.dbg.Disabled.build.debug_port=
thingdev.menu.dbg.Serial=Serial
thingdev.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
thingdev.menu.dbg.Serial1=Serial1
thingdev.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
thingdev.menu.lvl.None____=None
thingdev.menu.lvl.None____.build.debug_level=
thingdev.menu.optim.Smallest=None
thingdev.menu.optim.Smallest.build.debug_optim=-Os
thingdev.menu.optim.Lite=Lite
thingdev.menu.optim.Lite.build.debug_optim=-Os -fno-optimize-sibling-calls
thingdev.menu.optim.Full=Optimum
thingdev.menu.optim.Full.build.debug_optim=-Og
thingdev.menu.lvl.SSL=SSL
thingdev.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
thingdev.menu.lvl.TLS_MEM=TLS_MEM
thingdev.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
thingdev.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
thingdev.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.HTTP_SERVER=HTTP_SERVER
thingdev.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
thingdev.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
thingdev.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
thingdev.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
thingdev.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
thingdev.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.CORE=CORE
thingdev.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
thingdev.menu.lvl.WIFI=WIFI
thingdev.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
thingdev.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
thingdev.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
thingdev.menu.lvl.UPDATER=UPDATER
thingdev.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
thingdev.menu.lvl.OTA=OTA
thingdev.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
thingdev.menu.lvl.OOM=OOM
thingdev.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
thingdev.menu.lvl.MDNS=MDNS
thingdev.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
thingdev.menu.lvl.HWDT=HWDT
thingdev.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
thingdev.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
thingdev.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
thingdev.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
thingdev.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
thingdev.menu.wipe.none=Only Sketch
thingdev.menu.wipe.none.upload.erase_cmd=
thingdev.menu.wipe.sdk=Sketch + WiFi Settings
thingdev.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
thingdev.menu.wipe.all=All Flash Contents
thingdev.menu.wipe.all.upload.erase_cmd=erase_flash
thingdev.menu.baud.115200=115200
thingdev.menu.baud.115200.upload.speed=115200
thingdev.menu.baud.57600=57600
thingdev.menu.baud.57600.upload.speed=57600
thingdev.menu.baud.230400.linux=230400
thingdev.menu.baud.230400.macosx=230400
thingdev.menu.baud.230400.upload.speed=230400
thingdev.menu.baud.256000.windows=256000
thingdev.menu.baud.256000.upload.speed=256000
thingdev.menu.baud.460800.linux=460800
thingdev.menu.baud.460800.macosx=460800
thingdev.menu.baud.460800.upload.speed=460800
thingdev.menu.baud.512000.windows=512000
thingdev.menu.baud.512000.upload.speed=512000
thingdev.menu.baud.921600=921600
thingdev.menu.baud.921600.upload.speed=921600
thingdev.menu.baud.3000000=3000000
thingdev.menu.baud.3000000.upload.speed=3000000
thingdev.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
thingdev.menu.eesz.autoflash.build.flash_size=16M
thingdev.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
thingdev.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
thingdev.menu.eesz.autoflash.upload.maximum_size=1044464
thingdev.menu.iramfloat.no=Not allowed in ISR (more IRAM)
thingdev.menu.iramfloat.no.build.iramfloat=-DFP_IN_IROM
thingdev.menu.iramfloat.yes=Allowed in ISR (less IRAM)
thingdev.menu.iramfloat.yes.build.iramfloat=-DFP_IN_IRAM

